/**
 * Created by Administrator on 2017/2/12.
 */
var data =
{
    "萨摩亚":"684","澳大利亚":"61","科科斯群岛":"61","库克群岛":"682","斐济":"679","法属玻里尼西亚":"689","关岛":"1671","几内亚":"224",
    "马绍尔群岛":"692","密克罗尼西亚":"691","瑙鲁":"674","新喀里多尼亚":"687","新西兰":"64","诺福克岛":"6723","北马里亚纳群岛":"1670",
    "帛琉":"680","巴布亚新几内亚":"675","皮特凯恩岛":"64","美属萨摩亚":"685","索罗门群岛":"677","托克劳":"690","汤加":"676","图瓦卢":"688",
    "瓦努阿图":"678","沃利斯和富图纳群岛":"681","安圭拉岛":"1264","安提瓜和巴布达":"1268","阿根廷":"54","阿鲁巴":"297","巴哈马":"1242",
    "巴巴多斯":"1246","伯利兹城":"501","百慕大":"1441","玻利维亚":"591","巴西":"55","加拿大":"1","开曼群岛":"1345","智利":"56","哥伦比亚":"57",
    "哥斯达黎加":"506","古巴":"53","多米尼克国":"1767","多米尼加共和国":"1849","厄瓜多尔":"593","萨尔瓦多":"503","福克兰群岛":"500","法属圭亚那":"594",
    "格陵兰":"45","格林纳达":"1473","瓜德罗普岛":"590","危地马拉":"502","圭亚那":"592","海地":"509","洪都拉斯":"504","匈牙利":"36","牙买加":"1876",
    "马提尼克岛":"596","墨西哥":"52","蒙特塞拉特":"1664","荷兰安的列斯群岛":"599","尼加拉瓜":"505","巴拿马":"507","巴拉圭":"595","秘鲁":"51",
    "波多黎各":"1787","苏里南":"597","特立尼达和多巴哥":"1868","土克斯及开科斯群岛":"1809","美国":"1","乌拉圭":"598","委内瑞拉":"58",
    "维尔京群岛(英国)":"1284","维尔京群岛(美国)":"1340","圣基茨和尼维斯":"1869","圣文森特和格林纳丁斯":"1784","阿尔巴尼亚":"355","安道尔共和国":"376",
    "奥地利":"43","白俄罗斯":"375","比利时":"32","波斯尼亚和黑塞哥维那":"387","保加利亚":"359","克罗地亚":"385","捷克":"420","丹麦":"45","爱沙尼亚":"372",
    "法罗群岛":"298","芬兰":"358","法国":"33","法国大都会":"33","德国":"49","直布罗陀":"350","冰岛":"354","爱尔兰":"353","意大利":"39","拉脱维亚":"371",
    "列支敦士登":"423","立陶宛":"370","卢森堡":"352","马尔他":"356","摩尔多瓦":"373","黑山共和国":"382","荷兰":"31","挪威":"47","波兰":"48","葡萄牙":"351",
    "罗马尼亚":"40","俄罗斯联邦":"7","圣马力诺共和国":"378","塞尔维亚共和国":"381","斯洛伐克（斯洛伐克人的共和国）":"421","斯洛文尼亚":"386","西班牙":"34",
    "瑞典":"46","瑞士":"41","乌克兰":"380","英国":"44","梵蒂冈(罗马教廷)":"39","南斯拉夫":"381","格恩西岛":"441481","泽西岛":"44","马其顿":"389",
    "阿尔及利亚":"213","安哥拉":"244","贝宁":"229","博茨瓦纳":"267","布基纳法索":"226","布隆迪":"257","喀麦隆":"237","佛得角":"238","中非共和国":"236",
    "乍得":"235","科摩罗":"269","刚果":"242","刚果民主共和国":"243","Cote D'Ivoire":"225","吉布提":"253","埃及":"20","赤道几内亚":"240","厄立特里亚国":"291",
    "埃塞俄比亚":"251","加蓬":"241","冈比亚":"220","加纳":"233","希腊":"30","几内亚比绍":"245","肯尼亚":"254","莱索托":"266","利比里亚":"231","利比亚":"218",
    "马达加斯加":"261","马拉维":"265","马里":"223","毛里塔尼亚":"222","毛里求斯":"230","马约特":"262","摩纳哥":"377","摩洛哥":"212","莫桑比克":"258",
    "那米比亚":"264","尼日尔":"227","尼日利亚":"234","留尼汪岛":"262","卢旺达":"250","塞内加尔":"221","塞舌尔":"248","塞拉利昂":"232","索马里":"252",
    "南非":"27","苏丹":"249","斯威士兰":"268","坦桑尼亚":"255","多哥":"228","突尼斯":"216","乌干达":"256","西撒哈拉":"685","赞比亚":"260","津巴布韦":"263",
    "圣多美和普林西比":"239","南苏丹共和国":"211","阿富汗":"93","亚美尼亚":"374","阿塞拜疆":"994","巴林":"973","孟加拉国":"880","不丹":"975",
    "英属印度洋领地":"246","文莱达鲁萨兰国":"673","柬埔寨":"855","中国":"86","圣延岛":"61","塞浦路斯":"357","东帝汶":"670","格鲁吉亚":"995","香港":"852",
    "印度":"91","印度尼西亚":"62","伊朗（伊斯兰共和国）":"98","伊拉克":"964","以色列":"972","日本":"81","约旦":"962","哈萨克":"7","科威特":"965",
    "吉尔吉斯":"996","黎巴嫩":"961","澳门地区":"853","马来西亚":"60","马尔代夫":"960","外蒙古":"976","缅甸":"95","尼泊尔":"977","朝鲜":"850","阿曼":"968",
    "巴基斯坦":"92","巴勒斯坦":"970","菲律宾共和国":"63","卡塔尔":"974","沙特阿拉伯":"966","新加坡":"65","韩国":"82","斯里兰卡":"94","叙利亚":"963",
    "台湾地区":"886","塔吉克":"992","泰国":"66","土耳其":"90","土库曼":"993","阿拉伯联合酋长国":"971","乌兹别克斯坦":"998","越南":"84","也门":"967",
    "阿布哈兹":"7","南奥赛梯":"7","老挝":"856","圣卢西亚岛":"1758","圣马丁岛":"590"
};


$(document).ready(function(){
    $('#kw').on('input',function(){
        for(key in data){
//            $(this).val()==key&&console.log(data[key]);//输入时获取对应国家的编号
            $(this).val()==data[key];//输入时获取对应国家的编号
        }
    });
    $(document).keydown(function(e){
        e = e || window.event;
        var keycode = e.which ? e.which : e.keyCode;
        if(keycode == 38){
            if(jQuery.trim($("#append").html())==""){
                return;
            }
            movePrev();
        }else if(keycode == 40){
            if(jQuery.trim($("#append").html())==""){
                return;
            }
            $("#kw").blur();
            if($(".item").hasClass("addbg")){
                moveNext();
            }else{
                $(".item").removeClass('addbg').eq(0).addClass('addbg');
            }

        }else if(keycode == 13){
            if(jQuery.trim($("#kw").text())!==""){
                return;
            }
            dojob();
        }
    });

    var movePrev = function(){
        $("#kw").blur();
        var index = $(".addbg").prevAll().length;
        if(index == 0){
            $(".item").removeClass('addbg').eq($(".item").length-1).addClass('addbg');
        }else{
            $(".item").removeClass('addbg').eq(index-1).addClass('addbg');
        }
    }

    var moveNext = function(){
        var index = $(".addbg").prevAll().length;
        if(index == $(".item").length-1){
            $(".item").removeClass('addbg').eq(0).addClass('addbg');
        }else{
            $(".item").removeClass('addbg').eq(index+1).addClass('addbg');
        }

    }

    var dojob = function(){
        $("#kw").blur();
        console.log($(".addbg").attr("value")); //在这里回车时获取所属国家编号
        var value = $(".addbg").text();
        if(value!==""){
            $("#kw").val(value);
            $("#append").hide().html("");
        }
        console.log(e);

    }
});
function getContent(obj){
    var kw = jQuery.trim($(obj).val());
    if(kw == ""){
        $("#append").hide().html("");
        return false;
    }
    var html = "";
    for(key in data){
        if (key.indexOf(kw) >= 0) {
            html = html + "<div class='item'  value='"+data[key]+"'  onmouseenter='getFocus(this)' onClick='getCon(this);'>" + key + "</div>"
        }
    }

    if(html != ""){
        $("#append").show().html(html);
    }else{
        $("#append").hide().html("");
    }
}
function getFocus(obj){
    $(".item").removeClass("addbg");
    $(obj).addClass("addbg");
}
function getCon(obj){
    var value = $(obj).text();
    $("#kw").val(value);
    $("#append").hide().html("");
    console.log($(obj).attr("value"));//鼠标点击时获取当前国家所在编号
}